In [3]:
import pandas as pd 
import numpy as np

In [5]:
df_titanic = pd.read_csv(r'D:/Faculty-of-Applied-Mathematics-and-Computer-Science/Computer Science/Methods and Algorithms of Data Analysis/Laboratory 2/Datasets/Titanic/train.csv')

df_titanic = df_titanic.drop(columns=['PassengerId', 'Survived', 'Name', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'])

df_titanic

     Pclass     Sex   Age
0         3    male  22.0
1         1  female  38.0
2         3  female  26.0
3         1  female  35.0
4         3    male  35.0
..      ...     ...   ...
886       2    male  27.0
887       1  female  19.0
888       3  female   NaN
889       1    male  26.0
890       3    male  32.0

[891 rows x 3 columns]

In [58]:
def typeofcolumn(df):
    titanic = []
    titanic = df.columns
    
    for a in titanic:
        if df[a].dtype == 'int64':
            print(f'Столбец {a} отражает шкалу отношений')
        elif df[a].dtype == 'object':
            print(f'Столбец {a} отражает номинальную шкалу')
        else:
            print(f'Столбец {a} отражает порядковую шкалу')

typeofcolumn(df_titanic)

Столбец Pclass отражает шкалу отношений
Столбец Sex отражает номинальную шкалу
Столбец Age отражает порядковую шкалу

In [90]:
def to_nominal(df):
    df_nominal = pd.DataFrame(columns=['Age', 'Sex', 'Pclass'])

    for index, row in df.iterrows():
        if row['Age'] < 20:
            df_nominal = pd.concat([df_nominal, pd.DataFrame({'Age': ['young']})], ignore_index=True)
        elif row['Age'] >= 20 and row['Age'] < 40:
            df_nominal = pd.concat([df_nominal, pd.DataFrame({'Age': ['middle aged']})], ignore_index=True)
        else:
            df_nominal = pd.concat([df_nominal, pd.DataFrame({'Age': ['old']})], ignore_index=True)

        if row['Pclass'] == 1:
            df_nominal.at[index, 'Pclass'] = 'cheap'
        elif row['Pclass'] == 2:
            df_nominal.at[index, 'Pclass'] = 'middle'
        else:
            df_nominal.at[index, 'Pclass'] = 'premium'

    df_nominal['Sex'] = df['Sex']
    
    return df_nominal

to_nominal(df_titanic)

             Age     Sex   Pclass
0    middle aged    male  premium
1    middle aged  female    cheap
2    middle aged  female  premium
3    middle aged  female    cheap
4    middle aged    male  premium
..           ...     ...      ...
886  middle aged    male   middle
887        young  female    cheap
888          old  female  premium
889  middle aged    male    cheap
890  middle aged    male  premium

[891 rows x 3 columns]

In [ ]:
def to_order(df):